blog/15.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP. 2.2
#+subtitle: 2023-04-19 Wed
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)
#+latex_header:

* Hierarchical Data and the Closure Property

Lists can be used to represents sequences whose elements may
themselves be sequences.

#+begin_src
       Figure 2.5: Structure formed by `(cons (list 1 2) (list 3 4))'.

                                                    (3 4)
                                                      |
                                                      V
          ((1 2) 3 4)  +---+---+                  +---+---+     +---+---+
                  ---->| * | *-+----------------->| * | *-+---->| * | / |
                       +-|-+---+                  +-|-+---+     +-|-+---+
                         |                          |             |
                         V                          V             V
                (1 2)  +---+---+     +---+---+    +---+         +---+
                  ---->| * | *-+---->| * | / |    | 3 |         | 4 |
                       +-|-+---+     +-|-+---+    +---+         +---+
                         |             |
                         V             V
                       +---+         +---+
                       | 1 |         | 2 |
                       +---+         +---+
#+end_src

Sequences whose elements are sequences can be though of as /trees/.

#+begin_src
     Figure 2.6: The list structure in Figure 2-5 viewed as a tree.

           ((1 2) 3 4)
               /\\
              /  | \
          (1 2)  3 4
           / \
           1 2
#+end_src

#+begin_quote
Recursion is a natural tool for dealing with tree structures, since we
can often reduce operations on trees to operations on their branches,
which reduce in turn to operations on the branches of the branches,
and so on, until we reach the leaves of the tree. (p. 108)
#+end_quote

We can write a procedures that counts the number of leaves in tree,
somewhat similarly to what we have done when writing ~length~ for
counting the number of elements in a list...

#+begin_src scheme
  (define (count-leaves x)
    (con ((null? x) 0)
         ((not (pair? x)) 1)
         (+ (count-leaves (car x))
            (count-leaves (cdr x)))))
#+end_src

#+begin_quote
Just as ~map~ is a powerful abstraction for dealing with sequences,
~map~ together with recursion is a powerful abstraction for dealing
with trees. (p. 112)
#+end_quote

The following function takes a tree whose leaves are numbers and
returns it with each leaf multiplied by a factor:
#+begin_src scheme
  (define (scale-tree tree factor)
    (cond ((null? tree) nil)
          ((not (pair? tree)) (* tree factor))
          (else (cons (scale-tree (car tree) factor)
                      (scale-tree (cdr tree) factlr)))))
#+end_src
~scale-tree~ can be rewritten using map:
#+begin_src scheme
  (define (scale-tree tree factor)
    (map (lambda (sub-tree)
           (if (pair? subtree)
               (scale-tree sub-tree factor)
               (* sub-tree factor)))
         tree))
#+end_src

* TODO Exercise 2.24
*Exercise*:

#+begin_quote
Suppose we evaluate the expression ~(list 1 (list 2 (list 3
4)))~. Give the result printed by the interpreter, the corresponding
box-and-pointer structure, and the interpretation of this as a tree
(as in Figure 2.6).
#+end_quote

*Answer*:

* Exercise 2.25
*Exercise*:


#+begin_quote
Give combinations of ~cars~ and ~cdrs~ that will pick 7 from each of
the following lists:

#+begin_src scheme
  (1 3 (5 7) 9)
  ((7))
  (1 (2 (3 (4 (5 (6 7))))))
#+end_src
#+end_quote

*Answer*:

#+begin_src emacs-lisp
  (setq x '(1 3 (5 7) 9))
  (car (cdr (car (cdr (cdr x))))) ;; => 7

  (setq x '((7)))
  (car (car x)) ;; => 7

  (setq x '(1 (2 (3 (4 (5 (6 7)))))))
  (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr x)))))))))))) ;; => 7
#+end_src

* Exercise 2.26
*Exercise*:

#+begin_quote
Suppose we define x and y to be two lists:

#+begin_src scheme
  (define x (list 1 2 3))
  (define y (list 4 5 6))
#+end_src

What result is printed by the interpreter in response to evaluating
each of the following expressions:

#+begin_src scheme
  (append x y)
  (cons x y)
  (list x y)
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  ;; (append x y) => (1 2 3 4 5 6)
  ;; (cons x y)   => ((1 2 3) 4 5 6)
  ;; (list x y)   => ((1 2 3) (4 5 6))
#+end_src

