blog/15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-23 Sun 16:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 2.2.2</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 2.2.2
<br />
<span class="subtitle">2023-04-23 Sun</span>
</h1>

<div id="outline-container-org6b5df1c" class="outline-2">
<h2 id="org6b5df1c">Hierarchical Data and the Closure Property</h2>
<div class="outline-text-2" id="text-org6b5df1c">
<p>
Lists can be used to represents sequences whose elements may
themselves be sequences.
</p>

<pre class="example">
Figure 2.5: Structure formed by `(cons (list 1 2) (list 3 4))'.

                                             (3 4)
                                               |
                                               V
   ((1 2) 3 4)  +---+---+                  +---+---+     +---+---+
           ----&gt;| * | *-+-----------------&gt;| * | *-+----&gt;| * | / |
                +-|-+---+                  +-|-+---+     +-|-+---+
                  |                          |             |
                  V                          V             V
         (1 2)  +---+---+     +---+---+    +---+         +---+
           ----&gt;| * | *-+----&gt;| * | / |    | 3 |         | 4 |
                +-|-+---+     +-|-+---+    +---+         +---+
                  |             |
                  V             V
                +---+         +---+
                | 1 |         | 2 |
                +---+         +---+
</pre>

<p>
Sequences whose elements are sequences can be though of as <i>trees</i>.
</p>

<pre class="example">
Figure 2.6: The list structure in Figure 2-5 viewed as a tree.

      ((1 2) 3 4)
          /\\
         /  | \
     (1 2)  3 4
      / \
      1 2
</pre>

<blockquote>
<p>
Recursion is a natural tool for dealing with tree structures, since we
can often reduce operations on trees to operations on their branches,
which reduce in turn to operations on the branches of the branches,
and so on, until we reach the leaves of the tree. (p. 108)
</p>
</blockquote>

<p>
We can write a procedures that counts the number of leaves in tree,
somewhat similarly to what we have done when writing <code>length</code> for
counting the number of elements in a list&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">count-leaves</span> x)
  (con ((null? x) 0)
       ((not (pair? x)) 1)
       (+ (count-leaves (car x))
          (count-leaves (cdr x)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org76c6a6b" class="outline-2">
<h2 id="org76c6a6b">Exercise 2.24</h2>
<div class="outline-text-2" id="text-org76c6a6b">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Suppose we evaluate the expression <code>(list 1 (list 2 (list 3
4)))</code>. Give the result printed by the interpreter, the corresponding
box-and-pointer structure, and the interpretation of this as a tree
(as in Figure 2.6).
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(list 1 (list 2 (list 3 4))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; (1 (2 (3 4)))</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">box-and-pointer structure:</span>
<span style="color: #b22222;">;;</span>
<span style="color: #b22222;">;;  </span><span style="color: #b22222;">-&gt;[ | ]---&gt;[ |/]</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">|        |</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">v        v</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">1       [ | ]---&gt;[ |/]</span>
<span style="color: #b22222;">;;              </span><span style="color: #b22222;">|        |</span>
<span style="color: #b22222;">;;              </span><span style="color: #b22222;">v        v</span>
<span style="color: #b22222;">;;              </span><span style="color: #b22222;">2       [ | ]---&gt;[ |/]</span>
<span style="color: #b22222;">;;                       </span><span style="color: #b22222;">|        |</span>
<span style="color: #b22222;">;;                       </span><span style="color: #b22222;">v        v</span>
<span style="color: #b22222;">;;                       </span><span style="color: #b22222;">3        4</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">tree:</span>
<span style="color: #b22222;">;; </span>
<span style="color: #b22222;">;;        </span><span style="color: #b22222;">.</span>
<span style="color: #b22222;">;;       </span><span style="color: #b22222;">/ \</span>
<span style="color: #b22222;">;;      </span><span style="color: #b22222;">/   \</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">1     .</span>
<span style="color: #b22222;">;;          </span><span style="color: #b22222;">/ \</span>
<span style="color: #b22222;">;;         </span><span style="color: #b22222;">/   \</span>
<span style="color: #b22222;">;;        </span><span style="color: #b22222;">2     .</span>
<span style="color: #b22222;">;;             </span><span style="color: #b22222;">/ \</span>
<span style="color: #b22222;">;;            </span><span style="color: #b22222;">/   \</span>
<span style="color: #b22222;">;;           </span><span style="color: #b22222;">3     4</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cc7617" class="outline-2">
<h2 id="org8cc7617">Exercise 2.25</h2>
<div class="outline-text-2" id="text-org8cc7617">
<p>
<b>Exercise</b>:
</p>


<blockquote>
<p>
Give combinations of <code>cars</code> and <code>cdrs</code> that will pick 7 from each of
the following lists:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(1 3 (5 7) 9)
((7))
(1 (2 (3 (4 (5 (6 7))))))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq</span> x '(1 3 (5 7) 9))
(car (cdr (car (cdr (cdr x))))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 7</span>

(<span style="color: #a020f0;">setq</span> x '((7)))
(car (car x)) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 7</span>

(<span style="color: #a020f0;">setq</span> x '(1 (2 (3 (4 (5 (6 7)))))))
(car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr x)))))))))))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 7</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaacb0b9" class="outline-2">
<h2 id="orgaacb0b9">Exercise 2.26</h2>
<div class="outline-text-2" id="text-orgaacb0b9">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Suppose we define x and y to be two lists:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> (list 1 2 3))
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">y</span> (list 4 5 6))
</pre>
</div>

<p>
What result is printed by the interpreter in response to evaluating
each of the following expressions:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(append x y)
(cons x y)
(list x y)
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">(append x y) =&gt; (1 2 3 4 5 6)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(cons x y)   =&gt; ((1 2 3) 4 5 6)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(list x y)   =&gt; ((1 2 3) (4 5 6))</span>
</pre>
</div>
</div>
</div>
