blog/15.org
* Exercise 2.27
*Exercise*:
#+begin_quote
Modify your reverse procedure of Exercise 2.18 to produce a
deep-reverse procedure that takes a list as argument and returns as
its value the list with its elements reversed and with all sublists
deep-reversed as well. For example,

#+begin_src scheme
  (define x
    (list (list 1 2) (list 3 4)))

  x
  ((1 2) (3 4))

  (reverse x)
  ((3 4) (1 2))

  (deep-reverse x)
  ((4 3) (2 1))
#+end_src
#+end_quote

*Answer*:

Modification of the iterative-process-evolving procedure previously provided:
#+begin_src scheme
  (define (deep-reverse x)
    (define (iter x result)
      (cond ((null? x) result)
            ((not (pair? x)) x)
            (else (iter (cdr x)
                        (cons (iter (car x) nil) result))))) (iter x nil))
#+end_src

Modification of the recursive-process-evolving procedure previously
provided:
#+begin_src scheme
  (define (deep-reverse t)
    (cond ((null? t) nil)
          ((pair? t) (append (list (deep-reverse (cdr t)))
                             (list (deep-reverse (car t)))))
          (else (list t))))
#+end_src
* Exercise 2.28
*Exercise*:

#+begin_quote
Write a procedure ~fringe~ that takes as argument a tree (represented
as a list) and returns a list whose elements are all the leaves of the
tree arranged in left-to-right order. For example,

#+begin_src scheme
  (define x
    (list (list 1 2) (list 3 4)))

  (fringe x)
  (1 2 3 4)

  (fringe (list x x))
  (1 2 3 4 1 2 3 4)
#+end_src
#+end_quote

*Answer*:

#+begin_src scheme
  (define (fringe t)
    (cond ((null? t) nil)
          ((pair? t) (append (fringe (car t))
                             (fringe (cdr t))))
          (else (list t))))
#+end_src

