blog/15.html

<div id="outline-container-orgfc0cf4f" class="outline-2">
<h2 id="orgfc0cf4f">Exercise 2.27</h2>
<div class="outline-text-2" id="text-orgfc0cf4f">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Modify your reverse procedure of Exercise 2.18 to produce a
deep-reverse procedure that takes a list as argument and returns as
its value the list with its elements reversed and with all sublists
deep-reversed as well. For example,
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span>
  (list (list 1 2) (list 3 4)))

x
((1 2) (3 4))

(reverse x)
((3 4) (1 2))

(deep-reverse x)
((4 3) (2 1))
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Modification of the iterative-process-evolving procedure previously provided:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">deep-reverse</span> x)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> x result)
    (<span style="color: #a020f0;">cond</span> ((null? x) result)
          ((not (pair? x)) x)
          (<span style="color: #a020f0;">else</span> (iter (cdr x)
                      (cons (iter (car x) nil) result))))) (iter x nil))
</pre>
</div>

<p>
Modification of the recursive-process-evolving procedure previously
provided:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">deep-reverse</span> t)
  (<span style="color: #a020f0;">cond</span> ((null? t) nil)
        ((pair? t) (append (list (deep-reverse (cdr t)))
                           (list (deep-reverse (car t)))))
        (<span style="color: #a020f0;">else</span> (list t))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org75785ba" class="outline-2">
<h2 id="org75785ba">Exercise 2.28</h2>
<div class="outline-text-2" id="text-org75785ba">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Write a procedure <code>fringe</code> that takes as argument a tree (represented
as a list) and returns a list whose elements are all the leaves of the
tree arranged in left-to-right order. For example,
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span>
  (list (list 1 2) (list 3 4)))

(fringe x)
(1 2 3 4)

(fringe (list x x))
(1 2 3 4 1 2 3 4)
</pre>
</div>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fringe</span> t)
  (<span style="color: #a020f0;">cond</span> ((null? t) nil)
        ((pair? t) (append (fringe (car t))
                           (fringe (cdr t))))
        (<span style="color: #a020f0;">else</span> (list t))))
</pre>
</div>
</div>
</div>
