blog/15.org
* Exercise 2.29
*Exercise*:

#+begin_quote
A binary mobile consists of two branches, a left branch and a right
branch. Each branch is a rod of a certain length, from which hangs
either a weight or another binary mobile. We can represent a binary
mobile using compound data by constructing it from two branches (for
example, using ~list~):

#+begin_src scheme
  (define (make-mobile left right)
    (list left right))
#+end_src

A branch is constructed from a ~length~ (which must be a number)
together with a ~structure~, which may be either a number (representing
a simple weight) or another mobile:

#+begin_src scheme
  (define (make-branch length structure)
    (list length structure))
#+end_src

1. Write the corresponding selectors ~left-branch~ and ~right-branch~,
   which return the branches of a mobile, and ~branch-length~ and
   ~branch-structure~, which return the components of a branch.
2. Using your selectors, define a procedure ~total-weight~ that returns
   the total weight of a mobile.
3. A mobile is said to be /balanced/ if the torque applied by its
   top-left branch is equal to that applied by its top-right branch
   (that is, if the length of the left rod multiplied by the weight
   hanging from that rod is equal to the corresponding product for the
   right side) and if each of the submobiles hanging off its branches
   is balanced. Design a predicate that tests whether a binary mobile
   is balanced.
4. Suppose we change the representation of mobiles so that the
   constructors are

   #+begin_src scheme
     (define (make-mobile left right)
       (cons left right))

     (define (make-branch length structure)
       (cons length structure))
   #+end_src

   How much do you need to change your programs to convert to the new
   representation?
#+end_quote

*Answer*:

1:

#+begin_src scheme
  (define (make-mobile left right)
    (list left right))

  (define (make-branch length structure)
    (list length structure))

  (define (left-branch mobile)
    (car mobile))

  (define (right-branch mobile)
    (car (cdr mobile)))

  (define (branch-length branch)
    (car branch))

  (define (branch-structure branch)
    (car (cdr branch)))

#+end_src

2:

- The total weight of a mobile is the total weight of the left branch
  plus the total weight of the left branch. (In this context,
  something is a branch if its car is a pair.)

- The total weight of branch whose branch structure is a mobile, is
  the the total weight of the mobile. (We can check whether a the
  branch structure of a mobile is a mobile by checking whether is a
  pair).

- The total weight of a branch whose branch structure is a weight, is
  the the weight.

With these three rules above we can write our function:
#+begin_src scheme
  (define (total-weight x)
    (cond ((pair? (car x)) (+ (total-weight (left-branch x))
                              (total-weight (right-branch x))))
          ((pair? (branch-structure x)) (total-weight (branch-structure x)))
          ((not (pair? (branch-structure x))) (branch-structure x))))
#+end_src

#+begin_src scheme
  (make-mobile (make-branch 1 2) (make-branch 3 4)) ;; => ((1 2) (3 4))
  (left-branch (make-mobile (make-branch 1 2) (make-branch 3 4))) ;; => (1 2)
  (right-branch (make-mobile (make-branch 1 2) (make-branch 3 4))) ;; => (3 4)
  (branch-structure (right-branch (make-mobile (make-branch 1 2) (make-branch 3 4)))) ;; => 4
  (total-weight (make-mobile (make-branch 1 2) (make-branch 3 4))) ;; => 6
  (total-weight (make-mobile (make-branch 1 2) (make-mobile (make-branch 1 2) (make-branch 3 4)))) ;; => 8
  (total-weight (make-mobile (make-mobile (make-branch 1 2) (make-branch 3 4)) (make-mobile (make-branch 1 2) (make-branch 3 4)))) ;; => 12
#+end_src

3:

#+begin_src scheme
  (define (torque branch)
    (* (branch-length branch)
       (total-weight branch)))

  (define (isBalanced mobile)
    (cond ((not (pair? (branch-structure (right-branch mobile))))
           (= (torque (left-branch mobile))
              (torque (right-branch mobile))))
          (else (and (= (torque (left-branch mobile))
                        (torque (right-branch mobile)))
                     (isBalanced (branch-structure (right-branch mobile)))))))

  (isBalanced (make-mobile (make-branch 2 2) (make-branch 2 2))) ;; => #t
  (isBalanced (make-mobile (make-branch 2 2) (make-branch 2 3))) ;; => #f

  (isBalanced (make-mobile (make-branch 2 2)
                           (make-branch 2 (make-mobile (make-branch 1 1)
                                           (make-branch 1 1 ))))) ;; => #t
  (isBalanced (make-mobile (make-branch 2 2)
                           (make-branch 2 (make-mobile (make-branch 2 1)
                                                       (make-branch 1 1 ))))) ;; => #f
#+end_src

4:

If we changed the representation of mobiles so to have
#+begin_src scheme
  (define (make-mobile left right)
    (cons left right))

  (define (make-branch length structure)
    (cons length structure))
#+end_src
then, we would only need to change the selectors ~right-branch~ and
~branch-structure~:
#+begin_src scheme
  (define (right-branch mobile)
    (cdr mobile))

  (define (branch-structure branch)
    (cdr branch))
#+end_src

Both ~left-branch~ and ~branch-length~ would still work, and neither
~total-weight~ nor ~isBalanced~ depend on the details of how mobiles
and branchs are constructed.

