blog/15.html

<div id="outline-container-org85f76e5" class="outline-2">
<h2 id="org85f76e5">Exercise 2.29</h2>
<div class="outline-text-2" id="text-org85f76e5">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
A binary mobile consists of two branches, a left branch and a right
branch. Each branch is a rod of a certain length, from which hangs
either a weight or another binary mobile. We can represent a binary
mobile using compound data by constructing it from two branches (for
example, using <code>list</code>):
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-mobile</span> left right)
  (list left right))
</pre>
</div>

<p>
A branch is constructed from a <code>length</code> (which must be a number)
together with a <code>structure</code>, which may be either a number (representing
a simple weight) or another mobile:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-branch</span> length structure)
  (list length structure))
</pre>
</div>

<ol class="org-ol">
<li>Write the corresponding selectors <code>left-branch</code> and <code>right-branch</code>,
which return the branches of a mobile, and <code>branch-length</code> and
<code>branch-structure</code>, which return the components of a branch.</li>
<li>Using your selectors, define a procedure <code>total-weight</code> that returns
the total weight of a mobile.</li>
<li>A mobile is said to be <i>balanced</i> if the torque applied by its
top-left branch is equal to that applied by its top-right branch
(that is, if the length of the left rod multiplied by the weight
hanging from that rod is equal to the corresponding product for the
right side) and if each of the submobiles hanging off its branches
is balanced. Design a predicate that tests whether a binary mobile
is balanced.</li>
<li><p>
Suppose we change the representation of mobiles so that the
constructors are
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-mobile</span> left right)
  (cons left right))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-branch</span> length structure)
  (cons length structure))
</pre>
</div>

<p>
How much do you need to change your programs to convert to the new
representation?
</p></li>
</ol>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
1:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-mobile</span> left right)
  (list left right))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-branch</span> length structure)
  (list length structure))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">left-branch</span> mobile)
  (car mobile))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">right-branch</span> mobile)
  (car (cdr mobile)))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-length</span> branch)
  (car branch))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-structure</span> branch)
  (car (cdr branch)))

</pre>
</div>

<p>
2:
</p>

<ul class="org-ul">
<li>The total weight of a mobile is the total weight of the left branch
plus the total weight of the left branch. (In this context,
something is a branch if its car is a pair.)</li>

<li>The total weight of branch whose branch structure is a mobile, is
the the total weight of the mobile. (We can check whether a the
branch structure of a mobile is a mobile by checking whether is a
pair).</li>

<li>The total weight of a branch whose branch structure is a weight, is
the the weight.</li>
</ul>

<p>
With these three rules above we can write our function:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">total-weight</span> x)
  (<span style="color: #a020f0;">cond</span> ((pair? (car x)) (+ (total-weight (left-branch x))
                            (total-weight (right-branch x))))
        ((pair? (branch-structure x)) (total-weight (branch-structure x)))
        ((not (pair? (branch-structure x))) (branch-structure x))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(make-mobile (make-branch 1 2) (make-branch 3 4)) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; ((1 2) (3 4))</span>
(left-branch (make-mobile (make-branch 1 2) (make-branch 3 4))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; (1 2)</span>
(right-branch (make-mobile (make-branch 1 2) (make-branch 3 4))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; (3 4)</span>
(branch-structure (right-branch (make-mobile (make-branch 1 2) (make-branch 3 4)))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 4</span>
(total-weight (make-mobile (make-branch 1 2) (make-branch 3 4))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 6</span>
(total-weight (make-mobile (make-branch 1 2) (make-mobile (make-branch 1 2) (make-branch 3 4)))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 8</span>
(total-weight (make-mobile (make-mobile (make-branch 1 2) (make-branch 3 4)) (make-mobile (make-branch 1 2) (make-branch 3 4)))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; 12</span>
</pre>
</div>

<p>
3:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">torque</span> branch)
  (* (branch-length branch)
     (total-weight branch)))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">isBalanced</span> mobile)
  (<span style="color: #a020f0;">cond</span> ((not (pair? (branch-structure (right-branch mobile))))
         (= (torque (left-branch mobile))
            (torque (right-branch mobile))))
        (<span style="color: #a020f0;">else</span> (<span style="color: #a020f0;">and</span> (= (torque (left-branch mobile))
                      (torque (right-branch mobile)))
                   (isBalanced (branch-structure (right-branch mobile)))))))

(isBalanced (make-mobile (make-branch 2 2) (make-branch 2 2))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; #t</span>
(isBalanced (make-mobile (make-branch 2 2) (make-branch 2 3))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; #f</span>

(isBalanced (make-mobile (make-branch 2 2)
                         (make-branch 2 (make-mobile (make-branch 1 1)
                                         (make-branch 1 1 ))))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; #t</span>
(isBalanced (make-mobile (make-branch 2 2)
                         (make-branch 2 (make-mobile (make-branch 2 1)
                                                     (make-branch 1 1 ))))) <span style="color: #b22222;">;; </span><span style="color: #b22222;">=&gt; #f</span>
</pre>
</div>

<p>
4:
</p>

<p>
If we changed the representation of mobiles so to have
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-mobile</span> left right)
  (cons left right))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-branch</span> length structure)
  (cons length structure))
</pre>
</div>
<p>
then, we would only need to change the selectors <code>right-branch</code> and
<code>branch-structure</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">right-branch</span> mobile)
  (cdr mobile))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-structure</span> branch)
  (cdr branch))
</pre>
</div>

<p>
Both <code>left-branch</code> and <code>branch-length</code> would still work, and neither
<code>total-weight</code> nor <code>isBalanced</code> depend on the details of how mobiles
and branchs are constructed.
</p>
</div>
</div>
